/* 本程序逆序放置数组 */
/* 请在此处添加代码，获取15个浮点数放入数组中，将数组中的元素按逆序重新存放并输出 */
/********** Begin **********/
#include <stdio.h>
int main()
{
    float a[14];
    int i;
    scanf("%f %f %f %f %f %f %f %f %f %f %f %f %f %f %f",&a[0],&a[1],&a[2],&a[3],&a[4],&a[5],&a[6],&a[7],&a[8],&a[9],&a[10],&a[11],&a[12],&a[13],&a[14]);
    printf("逆序放置之后的数组为：");
    for(i=14;i>=0;i--)
    {
        printf("%.1f",a[i]);
        if(i>0)
        {
            printf("、");
        }
    }
    return 0;
}
    
    
/********** End **********/
